Процедура УстановитьДействие(Элемент, ИмяСобытия, Действие)
	Если НЕ ЗначениеЗаполнено(Элемент.ПолучитьДействие(ИмяСобытия)) Тогда
		Элемент.УстановитьДействие(ИмяСобытия, Действие);
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьСвязьСЭлементамиФормы(Контекст, Модель, Элементы) Экспорт
	// Добавление обработчиков НачалоВыбора, ПриИзменении
	Для Каждого Элемент Из Элементы Цикл
		ТипЭлемента = ТипЗнч(Элемент);
		Если ТипЭлемента = Тип("ТаблицаФормы") ИЛИ ТипЭлемента = Тип("ПолеФормы") Тогда
			Если ТипЭлемента = Тип("ТаблицаФормы") Тогда
				УстановитьДействие(Элемент, "ПриАктивизацииСтроки", "ПриАктивизацииСтроки");
			ИначеЕсли ТипЭлемента = Тип("ПолеФормы") И Элемент.Вид = ВидПоляФормы.ПолеВвода Тогда
				УстановитьДействие(Элемент, "НачалоВыбора", "НачалоВыбора");
//				Элемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
			КонецЕсли;
			УстановитьДействие(Элемент, "ПриИзменении", "ПриИзменении");
			ИДПараметра = СтрЗаменить(Элемент.ПутьКДанным, Модель.ПутьКДанным + ".", "");
			РаботаСФормойКлиентСервер.Элемент(Контекст, Модель, Элемент.Имя);
			//РаботаСФормойКлиентСервер.ДобавитьЗависимостьЭлемента(Модель, Элемент.Имя, ИДПараметра);
			Модель.ПараметрыЭлементов[Элемент.Имя] = ИДПараметра;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

