Функция Модель(Контекст, Знач ПутьКДанным = "") Экспорт
	Если ТипЗнч(Контекст) = Тип("ФормаКлиентскогоПриложения") И ПутьКДанным = "" Тогда
		ПутьКДанным = "Объект";
	КонецЕсли;
	Модель = РаботаСМодельюКлиентСервер.Модель("МодельЗаявкаНаОперацию", ПутьКДанным);

	//  Настройка зависимостей: Зависимый элемент <- Источник
	РаботаСМодельюКлиентСервер.Связь(Контекст, Модель, "ДоговорКонтрагента", "Организация", "Отбор.Организация");
	РаботаСМодельюКлиентСервер.Связь(Контекст, Модель, "ДоговорКонтрагента", "Контрагент", "Отбор.Контрагент");
	РаботаСМодельюКлиентСервер.Связь(Контекст, Модель, "ВалютаВзаиморасчетов", "ДоговорКонтрагента", "ДоговорКонтрагента");
	РаботаСМодельюКлиентСервер.Связь(Контекст, Модель, "ТипОперацииБюджетирование", "ВидОперации", "ВидОперации");
	РаботаСМодельюКлиентСервер.Связь(Контекст, Модель, "ПриходРасход", "ВидОперации", "ВидОперации");
	РаботаСМодельюКлиентСервер.Связь(Контекст, Модель, "СуммаВзаиморасчетов", "СуммаДокумента", "СуммаДокумента");
	РаботаСМодельюКлиентСервер.Связь(Контекст, Модель, "СуммаВзаиморасчетов", "КроссКурс", "КроссКурс");
	РаботаСМодельюКлиентСервер.Связь(Контекст, Модель, "ДвиженияОперации.СуммаВзаиморасчетов", "ДвиженияОперации.Сумма", "Сумма");
	РаботаСМодельюКлиентСервер.Связь(Контекст, Модель, "ДвиженияОперации.СуммаВзаиморасчетов", "КроссКурс", "КроссКурс");

	РаботаСМодельюКлиентСервер.Связь(Контекст, Модель, "СчетКонтрагента", "Контрагент", "Отбор.Владелец");
	РаботаСМодельюКлиентСервер.Связь(Контекст, Модель, "СчетКонтрагента", "ВалютаДокумента", "Отбор.Валюта",, 2);

	РаботаСМодельюКлиентСервер.Связь(Контекст, Модель, "КроссКурс", "Дата", "Дата");
	РаботаСМодельюКлиентСервер.Связь(Контекст, Модель, "КроссКурс", "ВалютаДокумента", "ВалютаДокумента");
	РаботаСМодельюКлиентСервер.Связь(Контекст, Модель, "КроссКурс", "ВалютаВзаиморасчетов", "ВалютаВзаиморасчетов");
	
	//  Настройка параметров состояния объекта
	Модель.Параметры["ТипОперацииБюджетирование"].ВыражениеЗначения = "ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ВидОперации, ""ТипОперацииБюджетирование"")";
	Модель.Параметры["ПриходРасход"].ВыражениеЗначения = "ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ВидОперации, ""ПриходРасход"")";
	Модель.Параметры["СуммаДокумента"].НаСервере = Ложь;
	Модель.Параметры["СуммаВзаиморасчетов"].НаСервере = Ложь;
	Модель.Параметры["СуммаВзаиморасчетов"].ВыражениеЗначения = "Окр(Параметры.СуммаДокумента * Параметры.КроссКурс, 2)";
	Модель.Параметры["ДвиженияОперации"].НаСервере = Ложь;
	Модель.Параметры["ДвиженияОперации"].ЭтоСсылка = Ложь;
	Модель.Параметры["ДвиженияОперации.Сумма"].НаСервере = Ложь;
	Модель.Параметры["ДвиженияОперации.СуммаВзаиморасчетов"].НаСервере = Ложь;
	Модель.Параметры["ДвиженияОперации.СуммаВзаиморасчетов"].ВыражениеЗначения = "Параметры.КроссКурс * Параметры.Сумма";
	Модель.Параметры["ВалютаВзаиморасчетов"].НаСервере = Истина;
	Модель.Параметры["ВалютаВзаиморасчетов"].ВыражениеЗначения = "ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ДоговорКонтрагента, ""Валюта"")";
	Модель.Параметры["ВалютаДокумента"].НаСервере = Ложь;
	Модель.Параметры["ДоговорКонтрагента"].ПроверкаЗаполнения = Ложь;

	Модель.Параметры["СчетКонтрагента"].ПриИзменении = "*";

	Модель.Параметры["КроссКурс"].ВыражениеЗначения = "*";

	//  Специальный параметр для таблицы
	Параметр = РаботаСМодельюКлиентСервер.Параметр(Контекст, Модель, "ДвиженияОперации.ИндексСтроки");
	Параметр.НаСервере = Ложь;
	Параметр.ПроверкаЗаполнения = Ложь;
	Параметр.ЭтоСсылка = Ложь;
	
	Возврат Модель;
КонецФункции