
Процедура ПриКопировании(ОбъектКопирования)
	Дата = ТекущаяДата();
	РаботаСМоделью.Инициализировать(ЭтотОбъект);
	РаботаСМоделью.ОбновитьДанные(ЭтотОбъект);//  проверить и рассчитать параметры
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Дата = ТекущаяДата();
	ФормаОплаты = Перечисления.ВидыДенежныхСредств.Безналичные;
	ВидОперации = Справочники.ВидыОперацийБюджетирование.ОплатаПоставщику;
	РаботаСМоделью.Инициализировать(ЭтотОбъект);
	РаботаСМоделью.ОбновитьДанные(ЭтотОбъект,, Истина);//  проверить и рассчитать параметры
КонецПроцедуры

