Функция СвойстваАдрес_Заголовок(Свойства, Параметры) Экспорт
	Если Параметры.АдресЗаполнен Тогда
		Свойства.Вставить("Заголовок", Параметры.Адрес);
	Иначе
		Свойства.Вставить("Заголовок", "<<нажмите для ввода ссылки>>");
	КонецЕсли;
	Возврат Истина;
КонецФункции

Функция СвойстваАдрес_КомандаОчистить(Свойства, Параметры) Экспорт
	Свойства.Вставить("Видимость", Параметры.АдресЗаполнен);
	Возврат Истина;
КонецФункции

Функция СвойстваАдрес_КомандаРедактировать(Свойства, Параметры) Экспорт
	Свойства.Вставить("Видимость", Параметры.АдресЗаполнен);
	Возврат Истина;
КонецФункции
