Функция СвойстваСчетКонтрагента(Свойства, Параметры) Экспорт
	Свойства.Вставить("Видимость", Параметры.ФормаОплаты = ПредопределенноеЗначение("Перечисление.ВидыДенежныхСредств.Безналичные"));
	Возврат Истина;
КонецФункции

Функция СвойстваФормаОплаты(Свойства, Параметры) Экспорт
	Свойства.Вставить("Доступность", НЕ Параметры.ТипОперацииБюджетирование = ПредопределенноеЗначение("Перечисление.ТипыОперацийБюжетирование.РасчетыПоНалогамИСборам"));
	Возврат Истина;
КонецФункции

Функция СвойстваКонтрагентРасчетов(Свойства, Параметры) Экспорт
	Свойства.Вставить("Видимость", Параметры.РасчетыЧерезТретьихЛиц);
	Возврат Истина;
КонецФункции

Функция СвойстваДоговорРасчетов(Свойства, Параметры) Экспорт
	Свойства.Вставить("Видимость", Параметры.РасчетыЧерезТретьихЛиц);
	Возврат Истина;
КонецФункции

Функция СвойстваГруппаРасчетыЧерезТретьихЛиц(Свойства, Параметры) Экспорт
	Свойства.Вставить("ЦветФона", ?(Параметры.РасчетыЧерезТретьихЛиц, Новый Цвет(251, 249, 236), Новый Цвет));
	Возврат Истина;
КонецФункции

Функция СвойстваСуммаВзаиморасчетов(Свойства, Параметры) Экспорт
	Свойства.Вставить("Видимость", НЕ Параметры.ВалютаВзаиморасчетов = Параметры.ВалютаДокумента);
	Возврат Истина;
КонецФункции

Функция СвойстваВалютаВзаиморасчетов(Свойства, Параметры) Экспорт
	Если Параметры.ВалютаВзаиморасчетов = Параметры.ВалютаДокумента Тогда
		Свойства.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Авто);
	Иначе
		Свойства.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Нет);
	КонецЕсли;
	Возврат Истина;
КонецФункции

Функция СвойстваСтраницаАналитикиБюджетирования(Свойства, Параметры) Экспорт
	Количество = Параметры.ДвиженияОперации.Количество();
	Свойства.Вставить("Заголовок", "Аналитики бюджетирования" + ?(Количество > 0, " (" + Количество + ")", ""));
	Возврат Истина;
КонецФункции

Функция СвойстваДвиженияОперацииСуммаВзаиморасчетов(Свойства, Параметры) Экспорт 
	Свойства.Вставить("Заголовок", ?(ЗначениеЗаполнено(Параметры.ВалютаВзаиморасчетов), СтрШаблон("Сумма расчетов, %1", Параметры.ВалютаВзаиморасчетов), "Сумма расчетов"));
	Возврат Истина;
КонецФункции

Функция СвойстваДвиженияОперацииСумма(Свойства, Параметры) Экспорт 
	Свойства.Вставить("Заголовок", ?(ЗначениеЗаполнено(Параметры.ВалютаДокумента), СтрШаблон("Сумма платежа, %1", Параметры.ВалютаДокумента), "Сумма платежа"));
	Возврат Истина;
КонецФункции
