Функция СвойстваЭтаФорма(Свойства, Параметры) Экспорт
	Если Параметры.Свойство("СреднийРейтинг") Тогда
		Свойства.Вставить("Заголовок", СтрШаблон("Выбран рейтинг %1, средний - %2", Параметры.Рейтинг, Параметры.СреднийРейтинг));
	Иначе
		Свойства.Вставить("Заголовок", СтрШаблон("Выбран рейтинг %1", Параметры.Рейтинг));
	КонецЕсли;
	Возврат Истина;
КонецФункции

Функция СвойстваДекорацияЗвезда11(Свойства, Параметры) Экспорт
	Свойства.Вставить("Видимость", Параметры.Рейтинг > 0);
	Возврат Истина;
КонецФункции

Функция СвойстваДекорацияЗвезда21(Свойства, Параметры) Экспорт
	Свойства.Вставить("Видимость", Параметры.Рейтинг > 1);
	Возврат Истина;
КонецФункции

Функция СвойстваДекорацияЗвезда31(Свойства, Параметры) Экспорт
	Свойства.Вставить("Видимость", Параметры.Рейтинг > 2);
	Возврат Истина;
КонецФункции

Функция СвойстваДекорацияЗвезда41(Свойства, Параметры) Экспорт
	Свойства.Вставить("Видимость", Параметры.Рейтинг > 3);
	Возврат Истина;
КонецФункции

Функция СвойстваДекорацияЗвезда51(Свойства, Параметры) Экспорт
	Свойства.Вставить("Видимость", Параметры.Рейтинг > 4);
	Возврат Истина;
КонецФункции

Функция СвойстваДекорацияЗвезда10(Свойства, Параметры) Экспорт
	Свойства.Вставить("Видимость", Параметры.Рейтинг < 1);
	Возврат Истина;
КонецФункции

Функция СвойстваДекорацияЗвезда20(Свойства, Параметры) Экспорт
	Свойства.Вставить("Видимость", Параметры.Рейтинг < 2);
	Возврат Истина;
КонецФункции

Функция СвойстваДекорацияЗвезда30(Свойства, Параметры) Экспорт
	Свойства.Вставить("Видимость", Параметры.Рейтинг < 3);
	Возврат Истина;
КонецФункции

Функция СвойстваДекорацияЗвезда40(Свойства, Параметры) Экспорт
	Свойства.Вставить("Видимость", Параметры.Рейтинг < 4);
	Возврат Истина;
КонецФункции

Функция СвойстваДекорацияЗвезда50(Свойства, Параметры) Экспорт
	Свойства.Вставить("Видимость", Параметры.Рейтинг < 5);
	Возврат Истина;
КонецФункции

#Если Сервер Тогда
Функция ЗначениеСреднийРейтинг(Контекст, Объект, Модель, Параметры, СтандартнаяОбработка, Отказ) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(РейтингБанков.Рейтинг) КАК СуммаРейтинга,
	|	КОЛИЧЕСТВО(РейтингБанков.Рейтинг) КАК КоличествоРейтинга
	|ИЗ
	|	РегистрСведений.РейтингБанков КАК РейтингБанков";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.КоличествоРейтинга > 0 Тогда
		Возврат Окр((Выборка.СуммаРейтинга + Параметры.Рейтинг) / (Выборка.КоличествоРейтинга + 1), 2);
	Иначе
		Возврат Параметры.Рейтинг;
	КонецЕсли;
КонецФункции
#КонецЕсли