Функция ПредставлениеГруппыНалоговыеРеквизиты(Параметры)
	Если ЗначениеЗаполнено(Параметры.КодБК) Тогда
		КБК = Параметры.КодБК;
	Иначе
		КБК = НСтр("ru = '<КБК: не указан>'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.КодОКАТО) Тогда
		КодТерритории = Параметры.КодОКАТО;
	Иначе
		КодТерритории = НСтр("ru = '<ОКАТО: не указано>'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.СтатусСоставителя) Тогда
		СтатусСоставителя = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Статус: %1'"),
			Параметры.СтатусСоставителя);
	Иначе
		СтатусСоставителя = НСтр("ru = '<Статус: не указан>'");
	КонецЕсли;
	
	Возврат КБК + "; "
		+ КодТерритории + "; "
		+ Параметры.ПоказательОснования + "; "
		+ Параметры.ПоказательПериода + "; "
		+ Параметры.ПоказательНомера + "; "
		+ Параметры.ПоказательДаты + "; "
		+ СтатусСоставителя + "; "
		+ Параметры.ИдентификаторПлатежа;
КонецФункции

Функция СвойстваНалоговыеРеквизиты(Свойства, Параметры) Экспорт
	Свойства.Вставить("Свернута", Параметры.НалоговыеРеквизиты_СвернутоеОтображение);
	Заголовок = ПредставлениеГруппыНалоговыеРеквизиты(Параметры);
	Свойства.Вставить("ЗаголовокСвернутогоОтображения", СтрШаблон("%1 (нажмите, чтобы развернуть)", Заголовок));
	Свойства.Вставить("Заголовок", СтрШаблон("%1 (нажмите, чтобы свернуть)", Заголовок));
	Возврат Истина;
КонецФункции

Функция СвойстваНалоговыеРеквизиты_Заголовок(Свойства, Параметры) Экспорт
	Если Параметры.НалоговыеРеквизиты_СвернутоеОтображение Тогда
		Свойства.Вставить("Заголовок", СтрШаблон("%1 (нажмите, чтобы развернуть)", ПредставлениеГруппыНалоговыеРеквизиты(Параметры)));
	Иначе
		Свойства.Вставить("Заголовок", СтрШаблон("%1 (нажмите, чтобы свернуть)", ПредставлениеГруппыНалоговыеРеквизиты(Параметры)));
	КонецЕсли;
	Возврат Истина;
КонецФункции

Функция СвойстваНалоговыеРеквизиты_Картинка(Свойства, Параметры) Экспорт
	Свойства.Вставить("Видимость", НЕ Параметры.НалоговыеРеквизиты_СвернутоеОтображение);
	Возврат Истина;
КонецФункции

Функция СвойстваНалоговыеРеквизиты_КартинкаСвернутогоОтображения(Свойства, Параметры) Экспорт
	Свойства.Вставить("Видимость", Параметры.НалоговыеРеквизиты_СвернутоеОтображение);
	Возврат Истина;
КонецФункции

Функция СвойстваНалоговыеРеквизиты_Элементы(Свойства, Параметры) Экспорт
	Свойства.Вставить("Видимость", НЕ Параметры.НалоговыеРеквизиты_СвернутоеОтображение);
	Возврат Истина;
КонецФункции
