Функция СвойстваКомандаВключитьЛевуюПанель(Свойства, Параметры) Экспорт
	Свойства.Вставить("Пометка", Параметры.ВидимостьЛевойПанели);
	Возврат Истина;
КонецФункции

Функция СвойстваКомандаВключитьПравуюПанель(Свойства, Параметры) Экспорт
	Свойства.Вставить("Пометка", Параметры.ВидимостьПравойПанели);
	Возврат Истина;
КонецФункции

Функция СвойстваКомандаВключитьНижнююПанель(Свойства, Параметры) Экспорт
	Свойства.Вставить("Пометка", Параметры.ВидимостьНижнейПанели);
	Возврат Истина;
КонецФункции

Функция СвойстваГруппаЛеваяПанель(Свойства, Параметры) Экспорт
	Свойства.Вставить("Видимость", Параметры.ВидимостьЛевойПанели);
	Возврат Истина;
КонецФункции

Функция СвойстваГруппаПраваяПанель(Свойства, Параметры) Экспорт
	Свойства.Вставить("Видимость", Параметры.ВидимостьПравойПанели);
	Возврат Истина;
КонецФункции

Функция СвойстваГруппаНижняяПанель(Свойства, Параметры) Экспорт
	Свойства.Вставить("Видимость", Параметры.ВидимостьНижнейПанели);
	Возврат Истина;
КонецФункции
